# How to filter Rows

In [9]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000],
    'Perfomance Score': [78, 50, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000                78
1      Bob   30  Los Angeles   60000                50
2  Charlie   35      Chicago   70000                90
3    David   40      Houston   80000                80

In [2]:
d = df1[df1['Salary'] > 50000]
print(d)

      Name  Age         City  Salary  Perfomance Score
1      Bob   30  Los Angeles   60000                50
2  Charlie   35      Chicago   70000                90
3    David   40      Houston   80000                80

In [3]:
# filter rows salary > 60000 <= 700000

In [18]:
d = df1[(df1['Age'] < 30) & (df1['Salary'] <= 70000)]
print(d)

    Name  Age      City  Salary  Perfomance Score
0  Alice   25  New York   50000                78